In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("D:\\homeprices.csv")
df

    area  bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       NaN   18  610000
3   3600       3.0   30  595000
4   4000       NaN    8  760000
5   4100       6.0    8  810000
6   5342       4.0    6  768450
7  45367       5.0    9  854554

In [3]:
df.bedrooms.mean()

4.166666666666667

In [4]:
df.bedrooms.median()

4.0

In [5]:
df.bedrooms=df.bedrooms.fillna(4)

In [6]:
df

    area  bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       4.0   18  610000
3   3600       3.0   30  595000
4   4000       4.0    8  760000
5   4100       6.0    8  810000
6   5342       4.0    6  768450
7  45367       5.0    9  854554

In [14]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Falcon', 'Falcon','Parrot', 'Parrot','Parrot','Parrot'],
                   'Max Speed': [380., 370.,340,390,26,23, 24., 26.],
                  "type":['Captive', 'Wild', 'Captive', 'Wild','Captive', 'Wild', 'Captive', 'Wild']})

# group by

In [15]:
df

   Animal  Max Speed     type
0  Falcon      380.0  Captive
1  Falcon      370.0     Wild
2  Falcon      340.0  Captive
3  Falcon      390.0     Wild
4  Parrot       26.0  Captive
5  Parrot       23.0     Wild
6  Parrot       24.0  Captive
7  Parrot       26.0     Wild

In [18]:
df.groupby("type").mean()

         Max Speed
type
Captive     192.50
Wild        202.25